MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_i2s.h
typedef struct {
       uint32_t RESERVED0[512];
  I2S_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[508];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001008) Peripheral Debug Control */
       uint32_t RESERVED2[5];
  I2S_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED3;
  I2S_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00001050) */
       uint32_t RESERVED4[3];
  I2S_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00001080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
       uint32_t RESERVED6[6];
  __IO uint32_t FMTCFG;                            /* !< (@ 0x00001100) This register configures the serial interface
                                                      format */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00001104) This register controls internal audio clock */
  __I  uint32_t STAT;                              /* !< (@ 0x00001108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) Interrupt FIFO Level Select Register */
  __IO uint32_t WCLKSRC;                           /* !< (@ 0x00001110) This register configures the WCLK Source */
       uint32_t RESERVED7;
  __IO uint32_t DIRCFG;                            /* !< (@ 0x00001118) This register configures the direction of data
                                                      pins(AD0/AD1) */
       uint32_t RESERVED8;
  __O  uint32_t TXDATA;                            /* !< (@ 0x00001120) Transmit Data Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001124) Receive Data Register */
       uint32_t RESERVED9[8];
  __IO uint32_t WMASK0;                            /* !< (@ 0x00001148) This register configures the word selection dit
                                                      mask for data pin 0(AD0) */
  __IO uint32_t WMASK1;                            /* !< (@ 0x0000114C) This register configures the word selection dit
                                                      mask for data pin 1(AD1) */
       uint32_t RESERVED10[4];
  __IO uint32_t MCLKDIV;                           /* !< (@ 0x00001160) This field configures MCLK division ratio */
  __IO uint32_t WCLKDIV;                           /* !< (@ 0x00001164) Configures WCLK division ratio */
  __IO uint32_t BCLKDIV;                           /* !< (@ 0x00001168) This field configures BCLK division ratio */
} I2S_Regs;

/*@}*/ /* end of group I2S */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* I2S Register Control Bits
******************************************************************************/

/* I2S_DMA_TRIG_TX_IMASK Bits */
/* I2S_DMA_TRIG_TX_IMASK[TXINT] Bits */
#define I2S_DMA_TRIG_TX_IMASK_TXINT_OFS          (2)                             /* !< TXINT Offset */
#define I2S_DMA_TRIG_TX_IMASK_TXINT_MASK         ((uint32_t)0x00000004U)         /* !< Enable  Transmit Interrupt. */
#define I2S_DMA_TRIG_TX_IMASK_TXINT_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S_DMA_TRIG_TX_IMASK_TXINT_SET          ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* I2S_DMA_TRIG_TX_RIS Bits */
/* I2S_DMA_TRIG_TX_RIS[TXINT] Bits */
#define I2S_DMA_TRIG_TX_RIS_TXINT_OFS            (2)                             /* !< TXINT Offset */
#define I2S_DMA_TRIG_TX_RIS_TXINT_MASK           ((uint32_t)0x00000004U)         /* !< Transmit Interrupt. */
#define I2S_DMA_TRIG_TX_RIS_TXINT_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_DMA_TRIG_TX_RIS_TXINT_SET            ((uint32_t)0x00000004U)         /* !< Interrupt occured */

/* I2S_DMA_TRIG_TX_MIS Bits */
/* I2S_DMA_TRIG_TX_MIS[TXINT] Bits */
#define I2S_DMA_TRIG_TX_MIS_TXINT_OFS            (2)                             /* !< TXINT Offset */
#define I2S_DMA_TRIG_TX_MIS_TXINT_MASK           ((uint32_t)0x00000004U)         /* !< Masked  Transmit Interrupt. */
#define I2S_DMA_TRIG_TX_MIS_TXINT_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_DMA_TRIG_TX_MIS_TXINT_SET            ((uint32_t)0x00000004U)         /* !< Interrupt occured */

/* I2S_DMA_TRIG_TX_ISET Bits */
/* I2S_DMA_TRIG_TX_ISET[TXINT] Bits */
#define I2S_DMA_TRIG_TX_ISET_TXINT_OFS           (2)                             /* !< TXINT Offset */
#define I2S_DMA_TRIG_TX_ISET_TXINT_MASK          ((uint32_t)0x00000004U)         /* !< Set  Transmit Interrupt. */
#define I2S_DMA_TRIG_TX_ISET_TXINT_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_DMA_TRIG_TX_ISET_TXINT_SET           ((uint32_t)0x00000004U)         /* !< Set Interrupt */

/* I2S_DMA_TRIG_RX_IMASK Bits */
/* I2S_DMA_TRIG_RX_IMASK[RXINT] Bits */
#define I2S_DMA_TRIG_RX_IMASK_RXINT_OFS          (1)                             /* !< RXINT Offset */
#define I2S_DMA_TRIG_RX_IMASK_RXINT_MASK         ((uint32_t)0x00000002U)         /* !< Enable Receive Interrupt. */
#define I2S_DMA_TRIG_RX_IMASK_RXINT_CLR          ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S_DMA_TRIG_RX_IMASK_RXINT_SET          ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */

/* I2S_DMA_TRIG_RX_RIS Bits */
/* I2S_DMA_TRIG_RX_RIS[RXINT] Bits */
#define I2S_DMA_TRIG_RX_RIS_RXINT_OFS            (1)                             /* !< RXINT Offset */
#define I2S_DMA_TRIG_RX_RIS_RXINT_MASK           ((uint32_t)0x00000002U)         /* !< Receive Interrupt. */
#define I2S_DMA_TRIG_RX_RIS_RXINT_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_DMA_TRIG_RX_RIS_RXINT_SET            ((uint32_t)0x00000002U)         /* !< Interrupt occured */

/* I2S_DMA_TRIG_RX_MIS Bits */
/* I2S_DMA_TRIG_RX_MIS[RXINT] Bits */
#define I2S_DMA_TRIG_RX_MIS_RXINT_OFS            (1)                             /* !< RXINT Offset */
#define I2S_DMA_TRIG_RX_MIS_RXINT_MASK           ((uint32_t)0x00000002U)         /* !< Masked Receive Interrupt. */
#define I2S_DMA_TRIG_RX_MIS_RXINT_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_DMA_TRIG_RX_MIS_RXINT_SET            ((uint32_t)0x00000002U)         /* !< Interrupt occured */

/* I2S_DMA_TRIG_RX_ISET Bits */
/* I2S_DMA_TRIG_RX_ISET[RXINT] Bits */
#define I2S_DMA_TRIG_RX_ISET_RXINT_OFS           (1)                             /* !< RXINT Offset */
#define I2S_DMA_TRIG_RX_ISET_RXINT_MASK          ((uint32_t)0x00000002U)         /* !< Set Receive Interrupt. */
#define I2S_DMA_TRIG_RX_ISET_RXINT_NO_EFFECT     ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_DMA_TRIG_RX_ISET_RXINT_SET           ((uint32_t)0x00000002U)         /* !< Set Interrupt */

/* I2S_IIDX Bits */
/* I2S_IIDX[STAT] Bits */
#define I2S_IIDX_STAT_OFS                        (0)                             /* !< STAT Offset */
#define I2S_IIDX_STAT_MASK                       ((uint32_t)0x000000FFU)         /* !< Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MIS registers.
                                                                                    15h-1Fh = Reserved */
#define I2S_IIDX_STAT_NO_INTR                    ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define I2S_IIDX_STAT_WCLKERR                    ((uint32_t)0x00000001U)         /* !< WCLK Error */
#define I2S_IIDX_STAT_RXIFG                      ((uint32_t)0x00000002U)         /* !< Receive interrupt; Interrupt Flag:
                                                                                    RX */
#define I2S_IIDX_STAT_TXIFG                      ((uint32_t)0x00000003U)         /* !< Transmit interrupt; Interrupt Flag:
                                                                                    TX */
#define I2S_IIDX_STAT_RXFIFO_OVF_EVT             ((uint32_t)0x00000004U)         /* !< RX FIFO Overflow Event/interrupt
                                                                                    pending */
#define I2S_IIDX_STAT_TXFIFO_UNF_EVT             ((uint32_t)0x00000005U)         /* !< TX FIFO underflow interrupt */
#define I2S_IIDX_STAT_DMA_DONE_RX                ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define I2S_IIDX_STAT_DMA_DONE_TX                ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define I2S_IIDX_STAT_DMA_PREIRQ_RX              ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define I2S_IIDX_STAT_DMA_PREIRQ_TX              ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

/* I2S_CPU_INT_IMASK Bits */
/* I2S_CPU_INT_IMASK[WCLKERR] Bits */
#define I2S_CPU_INT_IMASK_WCLKERR_OFS            (0)                             /* !< WCLKERR Offset */
#define I2S_CPU_INT_IMASK_WCLKERR_MASK           ((uint32_t)0x00000001U)         /* !< WCLKERR interrupt mask */
#define I2S_CPU_INT_IMASK_WCLKERR_DIS            ((uint32_t)0x00000000U)         /* !< Disable the interrupt mask */
#define I2S_CPU_INT_IMASK_WCLKERR_EN             ((uint32_t)0x00000001U)         /* !< Enable the interrupt mask */
/* I2S_CPU_INT_IMASK[RXINT] Bits */
#define I2S_CPU_INT_IMASK_RXINT_OFS              (1)                             /* !< RXINT Offset */
#define I2S_CPU_INT_IMASK_RXINT_MASK             ((uint32_t)0x00000002U)         /* !< Enable Receive Interrupt. */
#define I2S_CPU_INT_IMASK_RXINT_CLR              ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S_CPU_INT_IMASK_RXINT_SET              ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2S_CPU_INT_IMASK[TXINT] Bits */
#define I2S_CPU_INT_IMASK_TXINT_OFS              (2)                             /* !< TXINT Offset */
#define I2S_CPU_INT_IMASK_TXINT_MASK             ((uint32_t)0x00000004U)         /* !< Enable Transmit Interrupt. */
#define I2S_CPU_INT_IMASK_TXINT_CLR              ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S_CPU_INT_IMASK_TXINT_SET              ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2S_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define I2S_CPU_INT_IMASK_DMA_DONE_RX_OFS        (15)                            /* !< DMA_DONE_RX Offset */
#define I2S_CPU_INT_IMASK_DMA_DONE_RX_MASK       ((uint32_t)0x00008000U)         /* !< Enable DMA Done on RX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_IMASK_DMA_DONE_RX_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_CPU_INT_IMASK_DMA_DONE_RX_SET        ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* I2S_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define I2S_CPU_INT_IMASK_DMA_DONE_TX_OFS        (16)                            /* !< DMA_DONE_TX Offset */
#define I2S_CPU_INT_IMASK_DMA_DONE_TX_MASK       ((uint32_t)0x00010000U)         /* !< Enable DMA Done on TX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_IMASK_DMA_DONE_TX_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_CPU_INT_IMASK_DMA_DONE_TX_SET        ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* I2S_CPU_INT_IMASK[RXFIFO_OVF] Bits */
#define I2S_CPU_INT_IMASK_RXFIFO_OVF_OFS         (3)                             /* !< RXFIFO_OVF Offset */
#define I2S_CPU_INT_IMASK_RXFIFO_OVF_MASK        ((uint32_t)0x00000008U)         /* !< RXFIFO overflow event mask. */
#define I2S_CPU_INT_IMASK_RXFIFO_OVF_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S_CPU_INT_IMASK_RXFIFO_OVF_SET         ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* I2S_CPU_INT_IMASK[TXFIFO_UNF] Bits */
#define I2S_CPU_INT_IMASK_TXFIFO_UNF_OFS         (4)                             /* !< TXFIFO_UNF Offset */
#define I2S_CPU_INT_IMASK_TXFIFO_UNF_MASK        ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt mask */
#define I2S_CPU_INT_IMASK_TXFIFO_UNF_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S_CPU_INT_IMASK_TXFIFO_UNF_SET         ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */

/* I2S_CPU_INT_RIS Bits */
/* I2S_CPU_INT_RIS[WCLKERR] Bits */
#define I2S_CPU_INT_RIS_WCLKERR_OFS              (0)                             /* !< WCLKERR Offset */
#define I2S_CPU_INT_RIS_WCLKERR_MASK             ((uint32_t)0x00000001U)         /* !< This interrupt is set when:  - An
                                                                                    unexpected WCLK edge occurs during
                                                                                    the data delay period of a phase.
                                                                                    Note unexpected WCLK edges during the
                                                                                    word and idle periods of the phase
                                                                                    are not detected. -  In dual-phase
                                                                                    mode, when two WCLK edges are less
                                                                                    than 4 BCLK cycles apart. -  In
                                                                                    single-phase mode, when a WCLK pulse
                                                                                    occurs before the last channel. This
                                                                                    error requires a complete restart
                                                                                    since word synchronization has been
                                                                                    lost. */
#define I2S_CPU_INT_RIS_WCLKERR_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_RIS_WCLKERR_SET              ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* I2S_CPU_INT_RIS[RXINT] Bits */
#define I2S_CPU_INT_RIS_RXINT_OFS                (1)                             /* !< RXINT Offset */
#define I2S_CPU_INT_RIS_RXINT_MASK               ((uint32_t)0x00000002U)         /* !< Receive Interrupt. */
#define I2S_CPU_INT_RIS_RXINT_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_RIS_RXINT_SET                ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* I2S_CPU_INT_RIS[TXINT] Bits */
#define I2S_CPU_INT_RIS_TXINT_OFS                (2)                             /* !< TXINT Offset */
#define I2S_CPU_INT_RIS_TXINT_MASK               ((uint32_t)0x00000004U)         /* !< Transmit Interrupt. */
#define I2S_CPU_INT_RIS_TXINT_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_RIS_TXINT_SET                ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* I2S_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define I2S_CPU_INT_RIS_DMA_DONE_RX_OFS          (15)                            /* !< DMA_DONE_RX Offset */
#define I2S_CPU_INT_RIS_DMA_DONE_RX_MASK         ((uint32_t)0x00008000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_RIS_DMA_DONE_RX_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_CPU_INT_RIS_DMA_DONE_RX_SET          ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* I2S_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define I2S_CPU_INT_RIS_DMA_DONE_TX_OFS          (16)                            /* !< DMA_DONE_TX Offset */
#define I2S_CPU_INT_RIS_DMA_DONE_TX_MASK         ((uint32_t)0x00010000U)         /* !< DMA Done on TX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_RIS_DMA_DONE_TX_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_CPU_INT_RIS_DMA_DONE_TX_SET          ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* I2S_CPU_INT_RIS[RXFIFO_OVF] Bits */
#define I2S_CPU_INT_RIS_RXFIFO_OVF_OFS           (3)                             /* !< RXFIFO_OVF Offset */
#define I2S_CPU_INT_RIS_RXFIFO_OVF_MASK          ((uint32_t)0x00000008U)         /* !< RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define I2S_CPU_INT_RIS_RXFIFO_OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_RIS_RXFIFO_OVF_SET           ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* I2S_CPU_INT_RIS[TXFIFO_UNF] Bits */
#define I2S_CPU_INT_RIS_TXFIFO_UNF_OFS           (4)                             /* !< TXFIFO_UNF Offset */
#define I2S_CPU_INT_RIS_TXFIFO_UNF_MASK          ((uint32_t)0x00000010U)         /* !< TX FIFO Underflow Interrupt */
#define I2S_CPU_INT_RIS_TXFIFO_UNF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_RIS_TXFIFO_UNF_SET           ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

/* I2S_CPU_INT_MIS Bits */
/* I2S_CPU_INT_MIS[WCLKERR] Bits */
#define I2S_CPU_INT_MIS_WCLKERR_OFS              (0)                             /* !< WCLKERR Offset */
#define I2S_CPU_INT_MIS_WCLKERR_MASK             ((uint32_t)0x00000001U)         /* !< This interrupt is set when:  - An
                                                                                    unexpected WCLK edge occurs during
                                                                                    the data delay period of a phase.
                                                                                    Note unexpected WCLK edges during the
                                                                                    word and idle periods of the phase
                                                                                    are not detected. -  In dual-phase
                                                                                    mode, when two WCLK edges are less
                                                                                    than 4 BCLK cycles apart. -  In
                                                                                    single-phase mode, when a WCLK pulse
                                                                                    occurs before the last channel. This
                                                                                    error requires a complete restart
                                                                                    since word synchronization has been
                                                                                    lost. */
#define I2S_CPU_INT_MIS_WCLKERR_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_MIS_WCLKERR_SET              ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* I2S_CPU_INT_MIS[RXINT] Bits */
#define I2S_CPU_INT_MIS_RXINT_OFS                (1)                             /* !< RXINT Offset */
#define I2S_CPU_INT_MIS_RXINT_MASK               ((uint32_t)0x00000002U)         /* !< Masked Receive Interrupt. */
#define I2S_CPU_INT_MIS_RXINT_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_MIS_RXINT_SET                ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* I2S_CPU_INT_MIS[TXINT] Bits */
#define I2S_CPU_INT_MIS_TXINT_OFS                (2)                             /* !< TXINT Offset */
#define I2S_CPU_INT_MIS_TXINT_MASK               ((uint32_t)0x00000004U)         /* !< Masked Transmit Interrupt. */
#define I2S_CPU_INT_MIS_TXINT_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_MIS_TXINT_SET                ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* I2S_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define I2S_CPU_INT_MIS_DMA_DONE_RX_OFS          (15)                            /* !< DMA_DONE_RX Offset */
#define I2S_CPU_INT_MIS_DMA_DONE_RX_MASK         ((uint32_t)0x00008000U)         /* !< Masked DMA Done on RX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_MIS_DMA_DONE_RX_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_MIS_DMA_DONE_RX_SET          ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* I2S_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define I2S_CPU_INT_MIS_DMA_DONE_TX_OFS          (16)                            /* !< DMA_DONE_TX Offset */
#define I2S_CPU_INT_MIS_DMA_DONE_TX_MASK         ((uint32_t)0x00010000U)         /* !< Masked DMA Done on TX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_MIS_DMA_DONE_TX_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_MIS_DMA_DONE_TX_SET          ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* I2S_CPU_INT_MIS[RXFIFO_OVF] Bits */
#define I2S_CPU_INT_MIS_RXFIFO_OVF_OFS           (3)                             /* !< RXFIFO_OVF Offset */
#define I2S_CPU_INT_MIS_RXFIFO_OVF_MASK          ((uint32_t)0x00000008U)         /* !< Masked RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define I2S_CPU_INT_MIS_RXFIFO_OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_MIS_RXFIFO_OVF_SET           ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* I2S_CPU_INT_MIS[TXFIFO_UNF] Bits */
#define I2S_CPU_INT_MIS_TXFIFO_UNF_OFS           (4)                             /* !< TXFIFO_UNF Offset */
#define I2S_CPU_INT_MIS_TXFIFO_UNF_MASK          ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt */
#define I2S_CPU_INT_MIS_TXFIFO_UNF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S_CPU_INT_MIS_TXFIFO_UNF_SET           ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

